app/views/articles/show.html.erb

</p>
 <% @article.comments.each do |comment| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 1