app/controllers/articles_controller.rb

  def index
  #  @articles = Article.all.Kaminari.paginate_array(my_array_object).page(params[:page]).per(3)
myarray = Article.all
---
SELECT `articles`.* FROM `articles`

  def show
    @comment = Comment.find(params[:id])
    @article = Article.find(params[:id])
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = ? LIMIT 1  [["id", "1"]]
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = ? LIMIT 1  [["id", "1"]]

  def create
    @user = current_user
    @article = @user.articles.create(params[:article])
---
INSERT INTO `articles` (`created_at`, `description`, `title`, `updated_at`, `user_id`) VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 17 Jun 2012 16:51:17 UTC +00:00], ["description", "sdfa"], ["title", "adsf"], ["updated_at", Sun, 17 Jun 2012 16:51:17 UTC +00:00], ["user_id", 1]]