app/controllers/comments_controller.rb

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = ? LIMIT 1  [["id", "2"]]
---
  def new
    @article = Article.find(params[:id])

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = ? LIMIT 1  [["id", "1"]]
INSERT INTO `comments` (`article_id`, `commentonarticle`, `created_at`, `name`, `updated_at`) VALUES (?, ?, ?, ?, ?)
---
  def create
    @article = Article.find(params[:id])
    @comment = @article.comments.build(params[:comment])

    respond_to do |format|
      if @comment.save